#pragma once

#include <cstdint>

#pragma pack(push,1)

// 8-bit digital control flags at 0x6F: 1=throttle,2=brake,4=left,8=right,0x10=gear change,0x80=using downshift
union DigitalControlFlags {
    uint8_t value;
    struct {
        uint8_t throttle : 1;    // bit 0 (0x01)
        uint8_t brake : 1;    // bit 1 (0x02)
        uint8_t left : 1;    // bit 2 (0x04)
        uint8_t right : 1;    // bit 3 (0x08)
        uint8_t gearChange : 1;  // bit 4 (0x10)
        uint8_t _res1 : 2;    // bits 5-6
        uint8_t downshift : 1;    // bit 7 (0x80)
    } bits;
};

struct shortXYZ {
    int16_t X;
    int16_t Y;
    int16_t Z;
};

/* Credits - Prblanco, SDI */
struct CarDynamicData {

    /* 0x000 */ int32_t posX; /* 16384=1ft */
    /* 0x004 */ int32_t posY; /* 16384=1ft */
    /* 0x008 */ int32_t posZ; /* 16384=1ft */
    /* 0x00c */ int32_t angleZ;
    /* 0x010 */ int32_t angleX;
    /* 0x014 */ int32_t angleY;
    /* 0x018 */ int16_t speedAngleZ;
    /* 0x01a */ uint8_t field_0x01a;
    /* 0x01b */ uint8_t field_0x01b;
    /* 0x01c */ struct TrackSector* trackSectorPtr; /* ??? unclear - pointer to current track sector? */
    /* 0x020 */ uint32_t timeLastSplit1;
    /* 0x024 */ uint32_t timeLastSplit2;
    /* 0x028 */ uint32_t timeLastLap;
    /* 0x02c */ uint32_t timeBestSplit1;
    /* 0x030 */ uint32_t timeBestSplit2;
    /* 0x034 */ uint32_t timeBestLap;
    /* 0x038 */ uint32_t timePreviousBest;
    /* 0x03c */ int32_t steer;
    /* 0x040 */ uint32_t invisibleBits;   /* enum Car Parts? */
    /* 0x044 */ uint32_t previousInvisibleBits; /* enum Car Parts? */
    /* 0x048 */ uint32_t field_0x048;    /* related to impact of damage */
    /* 0x04c */ uint8_t field_0x04c;
    /* 0x04d */ uint8_t field_0x04d;
    /* 0x04e */ uint8_t field_0x04e;
    /* 0x04f */ uint8_t field_0x04f;
    /* 0x050 */ uint8_t field_0x050;
    /* 0x051 */ uint8_t field_0x051;
    /* 0x052 */ uint8_t field_0x052;
    /* 0x053 */ uint8_t field_0x053;
    /* 0x054 */ uint8_t field_0x054;
    /* 0x055 */ uint8_t field_0x055;
    /* 0x056 */ uint8_t field_0x056;
    /* 0x057 */ uint8_t field_0x057;
    /* 0x058 */ struct shortXYZ cog; /* ??? unclear */
    /* 0x05e */ int16_t unk_05E;
    /* 0x060 */ int16_t fuelLaps; /* 64 = 1 lap? */
    /* 0x062 */ int16_t engineRPM;
    /* 0x064 */ uint8_t field_0x064;
    /* 0x065 */ uint8_t field_0x065;
    /* 0x066 */ uint8_t field_0x066;
    /* 0x067 */ uint8_t field_0x067;
    /* 0x068 */ uint8_t field_0x068;
    /* 0x069 */ uint8_t field_0x069;
    /* 0x06a */ uint8_t field_0x06a;
    /* 0x06b */ uint8_t field_0x06b;
    /* 0x06c */ uint8_t field_0x06c;
    /* 0x06d */ uint8_t field_0x06d;
    /* 0x06e */ uint8_t field_0x06e;
    /* 0x06f */ DigitalControlFlags digitalInput;
    /* 0x070 */ int16_t currentLap;
    /* 0x072 */ byte currentGear;
    /* 0x073 */ byte teamIndex; /* ??? unclear */
    /* 0x074 */ uint8_t field_0x074;
    /* 0x075 */ uint8_t field_0x075;
    /* 0x076 */ uint8_t field_0x076;
    /* 0x077 */ uint8_t field_0x077;

    /* 0x078 */ byte autoBrakes : 1;
    /* 0x078 */ byte autoGears : 1;
    /* 0x078 */ byte autoRightCar : 1;
    /* 0x078 */ byte indestructible : 1;
    /* 0x078 */ byte tracionControl : 1;
    /* 0x078 */ byte steeringHelp : 1;
    /* 0x078 */ byte launchControl : 1;

    /* 0x079 */ uint8_t field_0x079;
    /* 0x07a */ uint8_t field_0x07a;

    /* 0x07b */ byte unk_0 : 1;
    /* 0x07b */ byte engineRunning : 1;
    /* 0x07b */ byte unk_2 : 1;
    /* 0x07b */ byte onPitStop : 1;
    /* 0x07b */ byte onPitOptionsScreen : 1; /* ??? unclear */
    /* 0x07b */ byte unk_5 : 1;
    /* 0x07b */ byte onPits : 1;

    /* 0x07c */ uint8_t field_0x07c;
    /* 0x07d */ uint8_t field_0x07d;
    /* 0x07e */ uint8_t field_0x07e;
    /* 0x07f */ byte tyreCompundIndex; /* ??? unclear */
    /* 0x080 */ uint8_t field_0x080;

    /* 0x081 */ byte blackFlag : 1;

    /* 0x082 */ uint8_t field_0x082;
    /* 0x083 */ uint8_t field_0x083;
    /* 0x084 */ byte failureType; /* failure enum */
    /* 0x085 */ uint8_t field_0x085;
    /* 0x086 */ uint8_t field_0x086;
    /* 0x087 */ uint8_t field_0x087;
    /* 0x088 */ uint8_t field_0x088;
    /* 0x089 */ uint8_t field_0x089;
    /* 0x08a */ uint8_t field_0x08a;
    /* 0x08b */ uint8_t field_0x08b;
    /* 0x08c */ uint8_t field_0x08c;
    /* 0x08d */ byte field_0x08d;
    /* 0x08e */ byte field_0x08e[12];

    /* 0x09a */ int16_t currentSpeed; /* 64=1ft/s */
    /* 0x09c */ uint8_t field_0x09c;
    /* 0x09d */ uint8_t field_0x09d;
    /* 0x09e */ byte failureLap; /* ??? unclear */
    /* 0x09f */ uint8_t field_0x09f;

    /* 0x0a0 */ int16_t field_0x0a0;
    /* 0x0a2 */ uint16_t field_0x0a2;
    /* 0x0a4 */ uint8_t field_0x0a4;
    /* 0x0a5 */ uint8_t field_0x0a5;
    /* 0x0a6 */ uint8_t field_0x0a6;
    /* 0x0a7 */ uint8_t field_0x0a7;
    /* 0x0a8 */ uint8_t field_0x0a8;
    /* 0x0a9 */ uint8_t field_0x0a9;
    /* 0x0aa */ uint8_t field_0x0aa;
    /* 0x0ab */ uint8_t field_0x0ab;
    /* 0x0ac */ uint8_t field_0x0ac;
    /* 0x0ad */ uint8_t field_0x0ad;
    /* 0x0ae */ uint8_t field_0x0ae;
    /* 0x0af */ uint8_t field_0x0af;
    /* 0x0b0 */ uint8_t field_0x0b0;
    /* 0x0b1 */ uint8_t field_0x0b1;
    /* 0x0b2 */ int16_t carMass; /* lb */
    /* 0x0b4 */ int16_t steeringAngle; /* ??? unclear */
    /* 0x0b6 */ uint8_t field_0x0b6;
    /* 0x0b7 */ uint8_t field_0x0b7;
    /* 0x0b8 */ int16_t field_0x0b8;
    /* 0x0ba */ int16_t field_0x0ba;
    /* 0x0bc */ uint8_t field_0x0bc;
    /* 0x0bd */ uint8_t field_0x0bd;
    /* 0x0be */ uint8_t field_0x0be;
    /* 0x0bf */ uint8_t field_0x0bf;

    /* 0x0c0 */ int32_t field_0x0c0;
    /* 0x0c4 */ int16_t dragRelated; /* ??? unclear - drag related? */
    /* 0x0c6 */ uint8_t field_0x0c6;
    /* 0x0c7 */ uint8_t field_0x0c7;
    /* 0x0c8 */ uint8_t field_0x0c8;
    /* 0x0c9 */ uint8_t field_0x0c9;
    /* 0x0ca */ int16_t field_0x0ca;
    /* 0x0cc */ byte field_0x0cc;
    /* 0x0cd */ byte field_0x0cd;

    /* 0x0ce */ byte outOfFuel : 1;
    /* 0x0ce */ byte unkCutEngine : 1;
    /* 0x0ce */ byte playerCar : 1;
    /* 0x0ce */ byte wallCollision : 1;

    /* 0x0cf */ uint8_t field_0x0cf;
    /* 0x0d0 */ uint8_t field_0x0d0;
    /* 0x0d1 */ uint8_t field_0x0d1;
    /* 0x0d2 */ uint8_t field_0x0d2;
    /* 0x0d3 */ uint8_t field_0x0d3;
    /* 0x0d4 */ uint8_t field_0x0d4;
    /* 0x0d5 */ uint8_t field_0x0d5;
    /* 0x0d6 */ int16_t field_0x0d6;
    /* 0x0d8 */ int16_t field_0x0d8;
    /* 0x0da */ uint8_t field_0x0da;
    /* 0x0db */ uint8_t field_0x0db;
    /* 0x0dc */ uint8_t field_0x0dc;
    /* 0x0dd */ uint8_t field_0x0dd;
    /* 0x0de */ uint8_t field_0x0de;
    /* 0x0df */ uint8_t field_0x0df;
    /* 0x0e0 */ uint8_t field_0x0e0;
    /* 0x0e1 */ uint8_t field_0x0e1;
    /* 0x0e2 */ uint8_t field_0x0e2;
    /* 0x0e3 */ uint8_t field_0x0e3;
    /* 0x0e4 */ uint8_t field_0x0e4;
    /* 0x0e5 */ byte field_0x0e5;
    /* 0x0e6 */ byte field_0x0e6;
    /* 0x0e7 */ uint8_t field_0x0e7;
    /* 0x0e8 */ uint8_t field_0x0e8;
    /* 0x0e9 */ uint8_t field_0x0e9;
    /* 0x0ea */ uint8_t field_0x0ea;
    /* 0x0eb */ uint8_t field_0x0eb;
    /* 0x0ec */ uint8_t field_0x0ec;
    /* 0x0ed */ uint8_t field_0x0ed;

    /* 0x0ee */ int16_t throttleLevel; /* 16384 = 100% */
    /* 0x0f0 */ uint8_t field_0x0f0;
    /* 0x0f1 */ uint8_t field_0x0f1;
    /* 0x0f2 */ uint8_t field_0x0f2;
    /* 0x0f3 */ uint8_t field_0x0f3;
    /* 0x0f4 */ uint8_t field_0x0f4;
    /* 0x0f5 */ uint8_t field_0x0f5;
    /* 0x0f6 */ int16_t enginePowerMultiplier; /* 16384 = 100% */
    /* 0x0f8 */ uint8_t field_0x0f8;
    /* 0x0f9 */ uint8_t field_0x0f9;
    /* 0x0fa */ uint8_t field_0x0fa;
    /* 0x0fb */ uint8_t field_0x0fb;
    /* 0x0fc */ uint8_t field_0x0fc;
    /* 0x0fd */ uint8_t field_0x0fd;
    /* 0x0fe */ byte var;
    /* 0x0ff */ uint8_t field_0x0ff;

    /* 0x100 */ uint8_t field_0x100;
    /* 0x101 */ uint8_t field_0x101;
    /* 0x102 */ uint8_t field_0x102;
    /* 0x103 */ uint8_t field_0x103;
    /* 0x104 */ uint8_t field_0x104;
    /* 0x105 */ uint8_t field_0x105;
    /* 0x106 */ uint8_t field_0x106;
    /* 0x107 */ uint8_t field_0x107;
    /* 0x108 */ uint8_t field_0x108;
    /* 0x109 */ uint8_t field_0x109;
    /* 0x10a */ uint8_t field_0x10a;
    /* 0x10b */ uint8_t field_0x10b;
    /* 0x10c */ uint8_t field_0x10c;
    /* 0x10d */ uint8_t field_0x10d;
    /* 0x10e */ int16_t field_0x10e;
    /* 0x110 */ uint8_t field_0x110;
    /* 0x111 */ uint8_t field_0x111;
    /* 0x112 */ uint8_t field_0x112;
    /* 0x113 */ uint8_t field_0x113;
    /* 0x114 */ uint8_t field_0x114;
    /* 0x115 */ uint8_t field_0x115;
    /* 0x116 */ uint8_t field_0x116;
    /* 0x117 */ uint8_t field_0x117;
    /* 0x118 */ uint8_t field_0x118;
    /* 0x119 */ uint8_t field_0x119;
    /* 0x11a */ uint8_t field_0x11a;
    /* 0x11b */ uint8_t field_0x11b;
    /* 0x11c */ uint8_t field_0x11c;
    /* 0x11d */ uint8_t field_0x11d;
    /* 0x11e */ uint8_t field_0x11e;
    /* 0x11f */ uint8_t field_0x11f;
    /* 0x120 */ uint8_t field_0x120;
    /* 0x121 */ byte gear; /* ??? unclear */
    /* 0x122 */ uint8_t field_0x122;
    /* 0x123 */ uint8_t field_0x123;
    /* 0x124 */ uint8_t field_0x124;
    /* 0x125 */ uint8_t field_0x125;
    /* 0x126 */ uint8_t field_0x126;
    /* 0x127 */ uint8_t field_0x127;
    /* 0x128 */ uint8_t field_0x128;
    /* 0x129 */ uint8_t field_0x129;
    /* 0x12a */ uint8_t field_0x12a;
    /* 0x12b */ uint8_t field_0x12b;
    /* 0x12c */ uint8_t field_0x12c;
    /* 0x12d */ uint8_t field_0x12d;
    /* 0x12e */ uint8_t field_0x12e;
    /* 0x12f */ uint8_t field_0x12f;
    /* 0x130 */ uint8_t field_0x130;
    /* 0x131 */ uint8_t field_0x131;
    /* 0x132 */ uint8_t field_0x132;
    /* 0x133 */ uint8_t field_0x133;
    /* 0x134 */ uint8_t field_0x134;
    /* 0x135 */ uint8_t field_0x135;
    /* 0x136 */ byte nSchedulePitStopsDone;
    /* 0x137 */ uint8_t field_0x137;
    /* 0x138 */ uint8_t field_0x138;
    /* 0x139 */ uint8_t field_0x139;
    /* 0x13a */ uint8_t field_0x13a;
    /* 0x13b */ uint8_t field_0x13b;
    /* 0x13c */ uint8_t field_0x13c;
    /* 0x13d */ uint8_t field_0x13d;
    /* 0x13e */ int16_t field_0x13e;
    /* 0x140 */ uint8_t field_0x140;
    /* 0x141 */ uint8_t field_0x141;
    /* 0x142 */ uint8_t field_0x142;
    /* 0x143 */ uint8_t field_0x143;
    /* 0x144 */ uint8_t field_0x144;
    /* 0x145 */ uint8_t field_0x145;
    /* 0x146 */ uint8_t field_0x146;
    /* 0x147 */ uint8_t field_0x147;
    /* 0x148 */ uint8_t field_0x148;
    /* 0x149 */ uint8_t field_0x149;
    /* 0x14a */ uint8_t field_0x14a;
    /* 0x14b */ uint8_t field_0x14b;
    /* 0x14c */ uint8_t field_0x14c;
    /* 0x14d */ uint8_t field_0x14d;
    /* 0x14e */ uint8_t field_0x14e;
    /* 0x14f */ uint8_t field_0x14f;
    /* 0x150 */ uint8_t field_0x150;
    /* 0x151 */ uint8_t field_0x151;
    /* 0x152 */ uint8_t field_0x152;
    /* 0x153 */ uint8_t field_0x153;
    /* 0x154 */ uint8_t field_0x154;
    /* 0x155 */ uint8_t field_0x155;
    /* 0x156 */ uint8_t field_0x156;
    /* 0x157 */ uint8_t field_0x157;
    /* 0x158 */ uint8_t field_0x158;
    /* 0x159 */ uint8_t field_0x159;
    /* 0x15a */ uint8_t field_0x15a;
    /* 0x15b */ uint8_t field_0x15b;
    /* 0x15c */ uint8_t field_0x15c;
    /* 0x15d */ uint8_t field_0x15d;
    /* 0x15e */ uint8_t field_0x15e;
    /* 0x15f */ uint8_t field_0x15f;
    /* 0x160 */ uint8_t field_0x160;
    /* 0x161 */ byte failureRelated; /* ??? unclear */
    /* 0x162 */ uint8_t field_0x162;
    /* 0x163 */ uint8_t field_0x163;
    /* 0x164 */ int32_t downforce; /* ??? unclear */
    /* 0x168 */ int16_t field_0x168;
    /* 0x16a */ int16_t aeroBalance; /* ??? unclear */
    /* 0x16c */ int32_t drag; /* ??? unclear */
    /* 0x170 */ uint8_t field_0x170;
    /* 0x171 */ uint8_t field_0x171;
    /* 0x172 */ uint8_t field_0x172;
    /* 0x173 */ uint8_t field_0x173;
    /* 0x174 */ uint8_t field_0x174;
    /* 0x175 */ uint8_t field_0x175;
    /* 0x176 */ uint8_t field_0x176;
    /* 0x177 */ uint8_t field_0x177;
    /* 0x178 */ uint8_t field_0x178;
    /* 0x179 */ byte field_0x179;
    /* 0x17a */ uint8_t field_0x17a;
    /* 0x17b */ uint8_t field_0x17b;
    /* 0x17c */ uint8_t field_0x17c;
    /* 0x17d */ uint8_t field_0x17d;
    /* 0x17e */ uint8_t field_0x17e;
    /* 0x17f */ uint8_t field_0x17f;
    /* 0x180 */ int16_t field_0x180;
    /* 0x182 */ int16_t field_0x182;
    /* 0x184 */ uint8_t field_0x184;
    /* 0x185 */ uint8_t field_0x185;
    /* 0x186 */ uint8_t field_0x186;
    /* 0x187 */ uint8_t field_0x187;
    /* 0x188 */ int32_t field_0x188[4];
    /* 0x198 */ byte nScheduledPitStops;
    /* 0x199 */ byte ptInLaps[3]; /* pit stop laps in selected strategy */
    /* 0x19c */ int32_t fuelAmount; /* ??? unclear */
    /* 0x1a0 */ uint8_t field_0x1a0;
    /* 0x1a1 */ uint8_t field_0x1a1;
    /* 0x1a2 */ uint8_t field_0x1a2;
    /* 0x1a3 */ uint8_t field_0x1a3;
    /* 0x1a4 */ uint8_t field_0x1a4;
    /* 0x1a5 */ uint8_t field_0x1a5;
    /* 0x1a6 */ uint8_t field_0x1a6;
    /* 0x1a7 */ uint8_t field_0x1a7;
    /* 0x1a8 */ uint8_t field_0x1a8;
    /* 0x1a9 */ uint8_t field_0x1a9;
    /* 0x1aa */ uint8_t field_0x1aa;
    /* 0x1ab */ uint8_t field_0x1ab;
    /* 0x1ac */ uint8_t field_0x1ac;
    /* 0x1ad */ uint8_t field_0x1ad;
    /* 0x1ae */ int16_t field_0x1ae;
    /* 0x1b0 */ uint8_t field_0x1b0;
    /* 0x1b1 */ uint8_t field_0x1b1;
    /* 0x1b2 */ uint8_t field_0x1b2;
    /* 0x1b3 */ uint8_t field_0x1b3;
    /* 0x1b4 */ uint8_t field_0x1b4;
    /* 0x1b5 */ uint8_t field_0x1b5;
    /* 0x1b6 */ uint8_t field_0x1b6;
    /* 0x1b7 */ uint8_t field_0x1b7;
    /* 0x1b8 */ uint8_t field_0x1b8;
    /* 0x1b9 */ uint8_t field_0x1b9;
    /* 0x1ba */ uint8_t field_0x1ba;
    /* 0x1bb */ uint8_t field_0x1bb;
    /* 0x1bc */ int16_t field_0x1bc;
    /* 0x1be */ uint8_t field_0x1be;
    /* 0x1bf */ uint8_t field_0x1bf;
    /* 0x1c0 */ uint8_t field_0x1c0;
    /* 0x1c1 */ uint8_t field_0x1c1;
    /* 0x1c2 */ uint8_t field_0x1c2;
    /* 0x1c3 */ uint8_t field_0x1c3;
    /* 0x1c4 */ uint8_t field_0x1c4;
    /* 0x1c5 */ uint8_t field_0x1c5;
    /* 0x1c6 */ byte gearRatios[7];
    /* 0x1cd */ byte nGears; /* number of forward gears */
    /* 0x1ce */ uint8_t field_0x1ce;
    /* 0x1cf */ uint8_t field_0x1cf;
    /* 0x1d0 */ uint8_t field_0x1d0;
    /* 0x1d1 */ uint8_t field_0x1d1;
    /* 0x1d2 */ uint8_t field_0x1d2;
    /* 0x1d3 */ uint8_t field_0x1d3;
    /* 0x1d4 */ uint8_t field_0x1d4;
    /* 0x1d5 */ uint8_t field_0x1d5;
    /* 0x1d6 */ uint8_t field_0x1d6;
    /* 0x1d7 */ uint8_t field_0x1d7;
    /* 0x1d8 */ uint8_t field_0x1d8;
    /* 0x1d9 */ uint8_t field_0x1d9;
    /* 0x1da */ uint8_t field_0x1da;
    /* 0x1db */ uint8_t field_0x1db;
    /* 0x1dc */ uint8_t field_0x1dc;
    /* 0x1dd */ uint8_t field_0x1dd;
    /* 0x1de */ uint8_t field_0x1de;
    /* 0x1df */ uint8_t field_0x1df;
    /* 0x1e0 */ uint8_t field_0x1e0;
    /* 0x1e1 */ uint8_t field_0x1e1;
    /* 0x1e2 */ uint8_t field_0x1e2;
    /* 0x1e3 */ uint8_t field_0x1e3;
    /* 0x1e4 */ uint8_t field_0x1e4;
    /* 0x1e5 */ uint8_t field_0x1e5;
    /* 0x1e6 */ uint8_t field_0x1e6;
    /* 0x1e7 */ uint8_t field_0x1e7;
    /* 0x1e8 */ uint8_t field_0x1e8;
    /* 0x1e9 */ uint8_t field_0x1e9;
    /* 0x1ea */ uint8_t field_0x1ea;
    /* 0x1eb */ uint8_t field_0x1eb;
    /* 0x1ec */ uint8_t field_0x1ec;
    /* 0x1ed */ uint8_t field_0x1ed;
    /* 0x1ee */ uint8_t field_0x1ee;
    /* 0x1ef */ uint8_t field_0x1ef;
    /* 0x1f0 */ uint8_t field_0x1f0;
    /* 0x1f1 */ uint8_t field_0x1f1;
    /* 0x1f2 */ uint8_t field_0x1f2;
    /* 0x1f3 */ uint8_t field_0x1f3;
    /* 0x1f4 */ uint8_t field_0x1f4;
    /* 0x1f5 */ uint8_t field_0x1f5;
    /* 0x1f6 */ uint8_t field_0x1f6;
    /* 0x1f7 */ uint8_t field_0x1f7;
    /* 0x1f8 */ uint8_t field_0x1f8;
    /* 0x1f9 */ uint8_t field_0x1f9;
    /* 0x1fa */ uint8_t field_0x1fa;
    /* 0x1fb */ uint8_t field_0x1fb;
    /* 0x1fc */ uint8_t field_0x1fc;
    /* 0x1fd */ uint8_t field_0x1fd;
    /* 0x1fe */ uint8_t field_0x1fe;
    /* 0x1ff */ uint8_t field_0x1ff;
    /* 0x200 */ uint8_t field_0x200;
    /* 0x201 */ uint8_t field_0x201;
    /* 0x202 */ uint8_t field_0x202;
    /* 0x203 */ uint8_t field_0x203;
    /* 0x204 */ int16_t physicsRelated_0x204; /* physics related */
    /* 0x206 */ int16_t physicsRelated_0x206; /* physics related */
    /* 0x208 */ int16_t physicsRelated_0x208; /* physics related */
    /* 0x20a */ uint8_t field_0x20a;
    /* 0x20b */ uint8_t field_0x20b;
    /* 0x20c */ uint8_t field_0x20c;
    /* 0x20d */ uint8_t field_0x20d;
    /* 0x20e */ uint8_t field_0x20e;
    /* 0x20f */ uint8_t field_0x20f;
    /* 0x210 */ uint8_t field_0x210;
    /* 0x211 */ uint8_t field_0x211;
    /* 0x212 */ uint8_t field_0x212;
    /* 0x213 */ uint8_t field_0x213;
    /* 0x214 */ uint8_t field_0x214;
    /* 0x215 */ uint8_t field_0x215;
    /* 0x216 */ uint8_t field_0x216;
    /* 0x217 */ uint8_t field_0x217;
    /* 0x218 */ uint8_t field_0x218;
    /* 0x219 */ uint8_t field_0x219;
    /* 0x21a */ uint8_t field_0x21a;
    /* 0x21b */ uint8_t field_0x21b;

    /* 0x21c */ byte ai : 1; /* ??? unclear */
    /* 0x21d */ uint8_t field_0x21d;
    /* 0x21e */ uint8_t field_0x21e;
    /* 0x21f */ uint8_t field_0x21f;
    /* 0x220 */ uint8_t field_0x220;
    /* 0x221 */ uint8_t field_0x221;
    /* 0x222 */ uint8_t field_0x222;
    /* 0x223 */ uint8_t field_0x223;
    /* 0x224 */ uint8_t field_0x224;
    /* 0x225 */ uint8_t field_0x225;
    /* 0x226 */ uint8_t field_0x226;
    /* 0x227 */ byte rearWing; /* ??? unclear */
    /* 0x228 */ uint8_t field_0x228;
    /* 0x229 */ uint8_t field_0x229;
    /* 0x22a */ uint8_t field_0x22a;
    /* 0x22b */ uint8_t field_0x22b;
    /* 0x22c */ uint8_t field_0x22c;
    /* 0x22d */ uint8_t field_0x22d;
    /* 0x22e */ uint8_t field_0x22e;
    /* 0x22f */ uint8_t field_0x22f;
    /* 0x230 */ uint8_t field_0x230;
    /* 0x231 */ uint8_t field_0x231;
    /* 0x232 */ uint8_t field_0x232;
    /* 0x233 */ uint8_t field_0x233;
    /* 0x234 */ uint8_t field_0x234;
    /* 0x235 */ uint8_t field_0x235;
    /* 0x236 */ uint8_t field_0x236;
    /* 0x237 */ uint8_t field_0x237;
    /* 0x238 */ uint8_t field_0x238;
    /* 0x239 */ uint8_t field_0x239;
    /* 0x23a */ uint8_t field_0x23a;
    /* 0x23b */ uint8_t field_0x23b;
    /* 0x23c */ uint8_t field_0x23c;
    /* 0x23d */ uint8_t field_0x23d;
    /* 0x23e */ uint8_t field_0x23e;
    /* 0x23f */ uint8_t field_0x23f;
    /* 0x240 */ int32_t field_0x240;
    /* 0x244 */ int32_t field_0x244;
    /* 0x248 */ uint8_t field_0x248;
    /* 0x249 */ uint8_t field_0x249;
    /* 0x24a */ byte brake;   /* ??? unclear - SDI indicate this offset as brake*/
    /* 0x24b */ byte brake2;
    /* 0x24c */ int16_t field_0x24c;
    /* 0x24e */ int16_t field_0x24e;
    /* 0x250 */ uint8_t field_0x250;
    /* 0x251 */ uint8_t field_0x251;
    /* 0x252 */ uint8_t field_0x252;
    /* 0x253 */ uint8_t field_0x253;
    /* 0x254 */ uint8_t field_0x254;
    /* 0x255 */ uint8_t field_0x255;
    /* 0x256 */ uint8_t field_0x256;
    /* 0x257 */ uint8_t field_0x257;
    /* 0x258 */ uint8_t field_0x258;
    /* 0x259 */ uint8_t field_0x259;
    /* 0x25a */ uint8_t field_0x25a;
    /* 0x25b */ uint8_t field_0x25b;
    /* 0x25c */ uint8_t field_0x25c;
    /* 0x25d */ uint8_t field_0x25d;
    /* 0x25e */ uint8_t field_0x25e;
    /* 0x25f */ uint8_t field_0x25f;
    /* 0x260 */ uint8_t field_0x260;
    /* 0x261 */ uint8_t field_0x261;
    /* 0x262 */ uint8_t field_0x262;
    /* 0x263 */ uint8_t field_0x263;
    /* 0x264 */ uint8_t field_0x264;
    /* 0x265 */ uint8_t field_0x265;
    /* 0x266 */ byte unk_0x266; /* max value 175 */
    /* 0x267 */ byte unk_0x267; /* max value 175 */
    /* 0x268 */ uint8_t field_0x268;
    /* 0x269 */ uint8_t field_0x269;
    /* 0x26a */ byte frontWing; /* ??? unclear */
    /* 0x26b */ uint8_t field_0x26b;
    /* 0x26c */ uint8_t field_0x26c;
    /* 0x26d */ uint8_t field_0x26d;
    /* 0x26e */ uint8_t field_0x26e;
    /* 0x26f */ uint8_t field_0x26f;
    /* 0x270 */ int16_t field_0x270;
    /* 0x272 */ uint8_t field_0x272;
    /* 0x273 */ uint8_t field_0x273;
    /* 0x274 */ uint8_t field_0x274;
    /* 0x275 */ uint8_t field_0x275;
    /* 0x276 */ uint8_t field_0x276;
    /* 0x277 */ uint8_t field_0x277;
    /* 0x278 */ uint8_t field_0x278;
    /* 0x279 */ uint8_t field_0x279;
    /* 0x27a */ uint8_t field_0x27a;
    /* 0x27b */ uint8_t field_0x27b;
    /* 0x27c */ uint8_t field_0x27c;
    /* 0x27d */ uint8_t field_0x27d;
    /* 0x27e */ uint8_t field_0x27e;
    /* 0x27f */ uint8_t field_0x27f;
    /* 0x280 */ uint8_t field_0x280;
    /* 0x281 */ uint8_t field_0x281;
    /* 0x282 */ uint8_t field_0x282;
    /* 0x283 */ uint8_t field_0x283;
    /* 0x284 */ int32_t physicsRelated_0x284; /* ??? unclear */
    /* 0x288 */ uint8_t field_0x288;
    /* 0x289 */ uint8_t field_0x289;
    /* 0x28a */ uint8_t field_0x28a;
    /* 0x28b */ uint8_t field_0x28b;
    /* 0x28c */ uint8_t field_0x28c;
    /* 0x28d */ uint8_t field_0x28d;
    /* 0x28e */ uint8_t field_0x28e;
    /* 0x28f */ uint8_t field_0x28f;
    /* 0x290 */ uint8_t field_0x290;
    /* 0x291 */ uint8_t field_0x291;
    /* 0x292 */ uint8_t field_0x292;
    /* 0x293 */ uint8_t field_0x293;
    /* 0x294 */ uint8_t field_0x294;
    /* 0x295 */ uint8_t field_0x295;
    /* 0x296 */ uint8_t field_0x296;
    /* 0x297 */ uint8_t field_0x297;
    /* 0x298 */ uint8_t field_0x298;
    /* 0x299 */ uint8_t field_0x299;
    /* 0x29a */ uint8_t field_0x29a;
    /* 0x29b */ uint8_t field_0x29b;
    /* 0x29c */ uint8_t field_0x29c;
    /* 0x29d */ uint8_t field_0x29d;
    /* 0x29e */ uint8_t field_0x29e;
    /* 0x29f */ uint8_t field_0x29f;
    /* 0x2a0 */ uint8_t field_0x2a0;
    /* 0x2a1 */ uint8_t field_0x2a1;
    /* 0x2a2 */ uint8_t field_0x2a2;
    /* 0x2a3 */ uint8_t field_0x2a3;
    /* 0x2a4 */ uint8_t field_0x2a4;
    /* 0x2a5 */ uint8_t field_0x2a5;
    /* 0x2a6 */ uint8_t field_0x2a6;
    /* 0x2a7 */ uint8_t field_0x2a7;
    /* 0x2a8 */ uint8_t field_0x2a8;
    /* 0x2a9 */ uint8_t field_0x2a9;
    /* 0x2aa */ uint8_t field_0x2aa;
    /* 0x2ab */ uint8_t field_0x2ab;
    /* 0x2ac */ uint8_t field_0x2ac;
    /* 0x2ad */ uint8_t field_0x2ad;
    /* 0x2ae */ uint8_t field_0x2ae;
    /* 0x2af */ uint8_t field_0x2af;
    /* 0x2b0 */ uint8_t field_0x2b0;
    /* 0x2b1 */ uint8_t field_0x2b1;
    /* 0x2b2 */ uint8_t field_0x2b2;
    /* 0x2b3 */ uint8_t field_0x2b3;
    /* 0x2b4 */ uint8_t field_0x2b4;
    /* 0x2b5 */ uint8_t field_0x2b5;
    /* 0x2b6 */ uint8_t field_0x2b6;
    /* 0x2b7 */ uint8_t field_0x2b7;
    /* 0x2b8 */ uint8_t field_0x2b8;
    /* 0x2b9 */ uint8_t field_0x2b9;
    /* 0x2ba */ uint8_t field_0x2ba;
    /* 0x2bb */ uint8_t field_0x2bb;
    /* 0x2bc */ uint8_t field_0x2bc;
    /* 0x2bd */ uint8_t field_0x2bd;
    /* 0x2be */ uint8_t field_0x2be;
    /* 0x2bf */ uint8_t field_0x2bf;
    /* 0x2c0 */ uint8_t field_0x2c0;
    /* 0x2c1 */ uint8_t field_0x2c1;
    /* 0x2c2 */ uint8_t field_0x2c2;
    /* 0x2c3 */ uint8_t field_0x2c3;
    /* 0x2c4 */ uint8_t field_0x2c4;
    /* 0x2c5 */ uint8_t field_0x2c5;
    /* 0x2c6 */ uint8_t field_0x2c6;
    /* 0x2c7 */ uint8_t field_0x2c7;
    /* 0x2c8 */ uint8_t field_0x2c8;
    /* 0x2c9 */ uint8_t field_0x2c9;
    /* 0x2ca */ uint8_t field_0x2ca;
    /* 0x2cb */ uint8_t field_0x2cb;
    /* 0x2cc */ uint8_t field_0x2cc;
    /* 0x2cd */ uint8_t field_0x2cd;
    /* 0x2ce */ uint8_t field_0x2ce;
    /* 0x2cf */ uint8_t field_0x2cf;
    /* 0x2d0 */ uint8_t field_0x2d0;
    /* 0x2d1 */ uint8_t field_0x2d1;
    /* 0x2d2 */ uint8_t field_0x2d2;
    /* 0x2d3 */ uint8_t field_0x2d3;
    /* 0x2d4 */ uint8_t field_0x2d4;
    /* 0x2d5 */ uint8_t field_0x2d5;
    /* 0x2d6 */ uint8_t field_0x2d6;
    /* 0x2d7 */ uint8_t field_0x2d7;
    /* 0x2d8 */ uint8_t field_0x2d8;
    /* 0x2d9 */ uint8_t field_0x2d9;
    /* 0x2da */ uint8_t field_0x2da;
    /* 0x2db */ uint8_t field_0x2db;
    /* 0x2dc */ uint8_t field_0x2dc;
    /* 0x2dd */ uint8_t field_0x2dd;
    /* 0x2de */ uint8_t field_0x2de;
    /* 0x2df */ uint8_t field_0x2df;
    /* 0x2e0 */ uint8_t field_0x2e0;
    /* 0x2e1 */ uint8_t field_0x2e1;
    /* 0x2e2 */ uint8_t field_0x2e2;
    /* 0x2e3 */ uint8_t field_0x2e3;
    /* 0x2e4 */ uint8_t field_0x2e4;
    /* 0x2e5 */ uint8_t field_0x2e5;
    /* 0x2e6 */ uint8_t field_0x2e6;
    /* 0x2e7 */ uint8_t field_0x2e7;
    /* 0x2e8 */ uint8_t field_0x2e8;
    /* 0x2e9 */ uint8_t field_0x2e9;
    /* 0x2ea */ uint8_t field_0x2ea;
    /* 0x2eb */ uint8_t field_0x2eb;
    /* 0x2ec */ int32_t tyreLoad[4]; /* [RL, RR, FL, FR] */
    /* 0x2fc */ int32_t suspensionTravel[4]; /* [RL, RR, FL, FR] */
    /* 0x30c */ uint8_t field_0x30c;
    /* 0x30d */ uint8_t field_0x30d;
    /* 0x30e */ uint8_t field_0x30e;
    /* 0x30f */ uint8_t field_0x30f;
    /* 0x310 */ uint8_t field_0x310;
    /* 0x311 */ uint8_t field_0x311;
    /* 0x312 */ uint8_t field_0x312;
    /* 0x313 */ uint8_t field_0x313;
    /* 0x314 */ uint8_t field_0x314;
    /* 0x315 */ uint8_t field_0x315;
    /* 0x316 */ uint8_t field_0x316;
    /* 0x317 */ uint8_t field_0x317;
    /* 0x318 */ uint8_t field_0x318;
    /* 0x319 */ uint8_t field_0x319;
    /* 0x31a */ uint8_t field_0x31a;
    /* 0x31b */ uint8_t field_0x31b;
    /* 0x31c */ uint8_t field_0x31c;
    /* 0x31d */ uint8_t field_0x31d;
    /* 0x31e */ uint8_t field_0x31e;
    /* 0x31f */ uint8_t field_0x31f;
    /* 0x320 */ uint8_t field_0x320;
    /* 0x321 */ uint8_t field_0x321;
    /* 0x322 */ uint8_t field_0x322;
    /* 0x323 */ uint8_t field_0x323;
    /* 0x324 */ uint8_t field_0x324;
    /* 0x325 */ uint8_t field_0x325;
    /* 0x326 */ uint8_t field_0x326;
    /* 0x327 */ uint8_t field_0x327;
    /* 0x328 */ uint8_t field_0x328;
    /* 0x329 */ uint8_t field_0x329;
    /* 0x32a */ uint8_t field_0x32a;
    /* 0x32b */ uint8_t field_0x32b;
    /* 0x32c */ uint8_t field_0x32c;
    /* 0x32d */ uint8_t field_0x32d;
    /* 0x32e */ uint8_t field_0x32e;
    /* 0x32f */ uint8_t field_0x32f;
    /* 0x330 */ uint8_t field_0x330;
    /* 0x331 */ uint8_t field_0x331;
    /* 0x332 */ uint8_t field_0x332;
    /* 0x333 */ uint8_t field_0x333;
    /* 0x334 */ uint8_t field_0x334;
    /* 0x335 */ uint8_t field_0x335;
    /* 0x336 */ uint8_t field_0x336;
    /* 0x337 */ uint8_t field_0x337;
    /* 0x338 */ uint8_t field_0x338;
    /* 0x339 */ uint8_t field_0x339;
    /* 0x33a */ uint8_t field_0x33a;
    /* 0x33b */ uint8_t field_0x33b;
    /* 0x33c */ uint8_t field_0x33c;
    /* 0x33d */ uint8_t field_0x33d;
    /* 0x33e */ uint8_t field_0x33e;
    /* 0x33f */ uint8_t field_0x33f;
    /* 0x340 */ uint8_t field_0x340;
    /* 0x341 */ uint8_t field_0x341;
    /* 0x342 */ uint8_t field_0x342;
    /* 0x343 */ uint8_t field_0x343;
    /* 0x344 */ uint8_t field_0x344;
    /* 0x345 */ uint8_t field_0x345;
    /* 0x346 */ uint8_t field_0x346;
    /* 0x347 */ uint8_t field_0x347;
    /* 0x348 */ uint8_t field_0x348;
    /* 0x349 */ uint8_t field_0x349;
    /* 0x34a */ uint8_t field_0x34a;
    /* 0x34b */ uint8_t field_0x34b;
    /* 0x34c */ uint8_t field_0x34c;
    /* 0x34d */ uint8_t field_0x34d;
    /* 0x34e */ uint8_t field_0x34e;
    /* 0x34f */ uint8_t field_0x34f;
    /* 0x350 */ uint8_t field_0x350;
    /* 0x351 */ uint8_t field_0x351;
    /* 0x352 */ uint8_t field_0x352;
    /* 0x353 */ uint8_t field_0x353;
    /* 0x354 */ uint8_t field_0x354;
    /* 0x355 */ uint8_t field_0x355;
    /* 0x356 */ uint8_t field_0x356;
    /* 0x357 */ uint8_t field_0x357;
    /* 0x358 */ uint8_t field_0x358;
    /* 0x359 */ uint8_t field_0x359;
    /* 0x35a */ uint8_t field_0x35a;
    /* 0x35b */ uint8_t field_0x35b;
    /* 0x35c */ uint8_t field_0x35c;
    /* 0x35d */ uint8_t field_0x35d;
    /* 0x35e */ uint8_t field_0x35e;
    /* 0x35f */ uint8_t field_0x35f;
    /* 0x360 */ uint8_t field_0x360;
    /* 0x361 */ uint8_t field_0x361;
    /* 0x362 */ uint8_t field_0x362;
    /* 0x363 */ uint8_t field_0x363;
    /* 0x364 */ uint8_t field_0x364;
    /* 0x365 */ uint8_t field_0x365;
    /* 0x366 */ uint8_t field_0x366;
    /* 0x367 */ uint8_t field_0x367;
    /* 0x368 */ uint8_t field_0x368;
    /* 0x369 */ uint8_t field_0x369;
    /* 0x36a */ uint8_t field_0x36a;
    /* 0x36b */ uint8_t field_0x36b;
    /* 0x36c */ uint8_t field_0x36c;
    /* 0x36d */ uint8_t field_0x36d;
    /* 0x36e */ uint8_t field_0x36e;
    /* 0x36f */ uint8_t field_0x36f;
    /* 0x370 */ uint8_t field_0x370;
    /* 0x371 */ uint8_t field_0x371;
    /* 0x372 */ uint8_t field_0x372;
    /* 0x373 */ uint8_t field_0x373;
    /* 0x374 */ uint8_t field_0x374;
    /* 0x375 */ uint8_t field_0x375;
    /* 0x376 */ uint8_t field_0x376;
    /* 0x377 */ uint8_t field_0x377;
    /* 0x378 */ uint8_t field_0x378;
    /* 0x379 */ uint8_t field_0x379;
    /* 0x37a */ uint8_t field_0x37a;
    /* 0x37b */ uint8_t field_0x37b;
    /* 0x37c */ uint8_t field_0x37c;
    /* 0x37d */ uint8_t field_0x37d;
    /* 0x37e */ uint8_t field_0x37e;
    /* 0x37f */ uint8_t field_0x37f;
    /* 0x380 */ uint8_t field_0x380;
    /* 0x381 */ uint8_t field_0x381;
    /* 0x382 */ uint8_t field_0x382;
    /* 0x383 */ uint8_t field_0x383;
    /* 0x384 */ uint8_t field_0x384;
    /* 0x385 */ uint8_t field_0x385;
    /* 0x386 */ uint8_t field_0x386;
    /* 0x387 */ uint8_t field_0x387;
    /* 0x388 */ uint8_t field_0x388;
    /* 0x389 */ uint8_t field_0x389;
    /* 0x38a */ uint8_t field_0x38a;
    /* 0x38b */ uint8_t field_0x38b;
    /* 0x38c */ uint8_t field_0x38c;
    /* 0x38d */ uint8_t field_0x38d;
    /* 0x38e */ uint8_t field_0x38e;
    /* 0x38f */ uint8_t field_0x38f;
    /* 0x390 */ uint8_t field_0x390;
    /* 0x391 */ uint8_t field_0x391;
    /* 0x392 */ uint8_t field_0x392;
    /* 0x393 */ uint8_t field_0x393;
    /* 0x394 */ uint8_t field_0x394;
    /* 0x395 */ uint8_t field_0x395;
    /* 0x396 */ uint8_t field_0x396;
    /* 0x397 */ uint8_t field_0x397;
    /* 0x398 */ uint8_t field_0x398;
    /* 0x399 */ uint8_t field_0x399;
    /* 0x39a */ uint8_t field_0x39a;
    /* 0x39b */ uint8_t field_0x39b;
    /* 0x39c */ uint8_t field_0x39c;
    /* 0x39d */ uint8_t field_0x39d;
    /* 0x39e */ uint8_t field_0x39e;
    /* 0x39f */ uint8_t field_0x39f;
    /* 0x3a0 */ uint8_t field_0x3a0;
    /* 0x3a1 */ uint8_t field_0x3a1;
    /* 0x3a2 */ uint8_t field_0x3a2;
    /* 0x3a3 */ uint8_t field_0x3a3;
    /* 0x3a4 */ uint8_t field_0x3a4;
    /* 0x3a5 */ uint8_t field_0x3a5;
    /* 0x3a6 */ uint8_t field_0x3a6;
    /* 0x3a7 */ uint8_t field_0x3a7;
    /* 0x3a8 */ uint8_t field_0x3a8;
    /* 0x3a9 */ uint8_t field_0x3a9;
    /* 0x3aa */ uint8_t field_0x3aa;
    /* 0x3ab */ uint8_t field_0x3ab;
    /* 0x3ac */ uint8_t field_0x3ac;
    /* 0x3ad */ uint8_t field_0x3ad;
    /* 0x3ae */ uint8_t field_0x3ae;
    /* 0x3af */ uint8_t field_0x3af;
    /* 0x3b0 */ uint8_t field_0x3b0;
    /* 0x3b1 */ uint8_t field_0x3b1;
    /* 0x3b2 */ uint8_t field_0x3b2;
    /* 0x3b3 */ uint8_t field_0x3b3;
    /* 0x3b4 */ uint8_t field_0x3b4;
    /* 0x3b5 */ uint8_t field_0x3b5;
    /* 0x3b6 */ uint8_t field_0x3b6;
    /* 0x3b7 */ uint8_t field_0x3b7;
    /* 0x3b8 */ uint8_t field_0x3b8;
    /* 0x3b9 */ uint8_t field_0x3b9;
    /* 0x3ba */ uint8_t field_0x3ba;
    /* 0x3bb */ uint8_t field_0x3bb;
    /* 0x3bc */ uint8_t field_0x3bc;
    /* 0x3bd */ uint8_t field_0x3bd;
    /* 0x3be */ uint8_t field_0x3be;
    /* 0x3bf */ uint8_t field_0x3bf;
    /* 0x3c0 */ uint8_t field_0x3c0;
    /* 0x3c1 */ uint8_t field_0x3c1;
    /* 0x3c2 */ uint8_t field_0x3c2;
    /* 0x3c3 */ uint8_t field_0x3c3;
    /* 0x3c4 */ uint8_t field_0x3c4;
    /* 0x3c5 */ uint8_t field_0x3c5;
    /* 0x3c6 */ uint8_t field_0x3c6;
    /* 0x3c7 */ uint8_t field_0x3c7;
    /* 0x3c8 */ uint8_t field_0x3c8;
    /* 0x3c9 */ uint8_t field_0x3c9;
    /* 0x3ca */ uint8_t field_0x3ca;
    /* 0x3cb */ uint8_t field_0x3cb;
    /* 0x3cc */ uint8_t field_0x3cc;
    /* 0x3cd */ uint8_t field_0x3cd;
    /* 0x3ce */ uint8_t field_0x3ce;
    /* 0x3cf */ uint8_t field_0x3cf;
    /* 0x3d0 */ uint8_t field_0x3d0;
    /* 0x3d1 */ uint8_t field_0x3d1;
    /* 0x3d2 */ uint8_t field_0x3d2;
    /* 0x3d3 */ uint8_t field_0x3d3;
    /* 0x3d4 */ uint8_t field_0x3d4;
    /* 0x3d5 */ uint8_t field_0x3d5;
    /* 0x3d6 */ uint8_t field_0x3d6;
    /* 0x3d7 */ uint8_t field_0x3d7;
    /* 0x3d8 */ uint8_t field_0x3d8;
    /* 0x3d9 */ uint8_t field_0x3d9;
    /* 0x3da */ uint8_t field_0x3da;
    /* 0x3db */ uint8_t field_0x3db;
    /* 0x3dc */ uint8_t field_0x3dc;
    /* 0x3dd */ uint8_t field_0x3dd;
    /* 0x3de */ uint8_t field_0x3de;
    /* 0x3df */ uint8_t field_0x3df;
    /* 0x3e0 */ uint8_t field_0x3e0;
    /* 0x3e1 */ uint8_t field_0x3e1;
    /* 0x3e2 */ uint8_t field_0x3e2;
    /* 0x3e3 */ uint8_t field_0x3e3;
    /* 0x3e4 */ uint8_t field_0x3e4;
    /* 0x3e5 */ uint8_t field_0x3e5;
    /* 0x3e6 */ uint8_t field_0x3e6;
    /* 0x3e7 */ uint8_t field_0x3e7;
    /* 0x3e8 */ uint8_t field_0x3e8;
    /* 0x3e9 */ uint8_t field_0x3e9;
    /* 0x3ea */ uint8_t field_0x3ea;
    /* 0x3eb */ uint8_t field_0x3eb;
    /* 0x3ec */ uint8_t field_0x3ec;
    /* 0x3ed */ uint8_t field_0x3ed;
    /* 0x3ee */ uint8_t field_0x3ee;
    /* 0x3ef */ uint8_t field_0x3ef;
    /* 0x3f0 */ uint8_t field_0x3f0;
    /* 0x3f1 */ uint8_t field_0x3f1;
    /* 0x3f2 */ uint8_t field_0x3f2;
    /* 0x3f3 */ uint8_t field_0x3f3;
    /* 0x3f4 */ uint8_t field_0x3f4;
    /* 0x3f5 */ uint8_t field_0x3f5;
    /* 0x3f6 */ uint8_t field_0x3f6;
    /* 0x3f7 */ uint8_t field_0x3f7;
    /* 0x3f8 */ uint8_t field_0x3f8;
    /* 0x3f9 */ uint8_t field_0x3f9;
    /* 0x3fa */ uint8_t field_0x3fa;
    /* 0x3fb */ uint8_t field_0x3fb;
    /* 0x3fc */ uint8_t field_0x3fc;
    /* 0x3fd */ uint8_t field_0x3fd;
    /* 0x3fe */ uint8_t field_0x3fe;
    /* 0x3ff */ uint8_t field_0x3ff;
    /* 0x400 */ uint8_t field_0x400;
    /* 0x401 */ uint8_t field_0x401;
    /* 0x402 */ uint8_t field_0x402;
    /* 0x403 */ uint8_t field_0x403;
    /* 0x404 */ uint8_t field_0x404;
    /* 0x405 */ uint8_t field_0x405;
    /* 0x406 */ uint8_t field_0x406;
    /* 0x407 */ uint8_t field_0x407;
    /* 0x408 */ uint8_t field_0x408;
    /* 0x409 */ uint8_t field_0x409;
    /* 0x40a */ uint8_t field_0x40a;
    /* 0x40b */ uint8_t field_0x40b;
    /* 0x40c */ uint8_t field_0x40c;
    /* 0x40d */ uint8_t field_0x40d;
    /* 0x40e */ uint8_t field_0x40e;
    /* 0x40f */ uint8_t field_0x40f;
    /* 0x410 */ uint8_t field_0x410;
    /* 0x411 */ uint8_t field_0x411;
    /* 0x412 */ uint8_t field_0x412;
    /* 0x413 */ uint8_t field_0x413;
    /* 0x414 */ uint8_t field_0x414;
    /* 0x415 */ uint8_t field_0x415;
    /* 0x416 */ uint8_t field_0x416;
    /* 0x417 */ uint8_t field_0x417;
    /* 0x418 */ uint8_t field_0x418;
    /* 0x419 */ uint8_t field_0x419;
    /* 0x41a */ uint8_t field_0x41a;
    /* 0x41b */ uint8_t field_0x41b;
};


static_assert(sizeof(CarDynamicData) == 0x41c, "CarDynamicData has incorrect size");

struct TrackSector {
    uint8_t field0_0x0;
    uint8_t field1_0x1;
    uint8_t field2_0x2;
    uint8_t field3_0x3;
    uint8_t field4_0x4;
    uint8_t field5_0x5;
    uint8_t field6_0x6;
    uint8_t field7_0x7;
    uint8_t field8_0x8;
    uint8_t field9_0x9;
    uint8_t field10_0xa;
    uint8_t field11_0xb;
    uint8_t field12_0xc;
    uint8_t field13_0xd;
    uint8_t field14_0xe;
    uint8_t field15_0xf;
    uint8_t field16_0x10;
    uint8_t field17_0x11;
    uint8_t field18_0x12;
    uint8_t field19_0x13;
    uint8_t field20_0x14;
    uint8_t field21_0x15;
    uint8_t field22_0x16;
    uint8_t field23_0x17;
    uint8_t field24_0x18;
    uint8_t field25_0x19;
    uint8_t field26_0x1a;
    uint8_t field27_0x1b;
    uint8_t field28_0x1c;
    uint8_t field29_0x1d;
    uint8_t field30_0x1e;
    uint8_t field31_0x1f;
    uint8_t field32_0x20;
